# GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.
Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [4]:
address = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'

### Step 3. Assign it to a variable called drinks.

In [5]:
drinks = pd.read_csv(address,sep = ',')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [23]:
drinks_continent = drinks.groupby("continent").sum()
drinks_continent

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,3258,866,862,159.4
AS,1630,2677,399,95.5
EU,8720,5965,6400,387.8
OC,1435,935,570,54.1
SA,2101,1377,749,75.7

In [24]:
only_servings = drinks_continent.drop(columns=['total_litres_of_pure_alcohol'])
only_servings

           beer_servings  spirit_servings  wine_servings
continent
AF                  3258              866            862
AS                  1630             2677            399
EU                  8720             5965           6400
OC                  1435              935            570
SA                  2101             1377            749

In [22]:
# Inserto nueva columna con el porcentaje de cervezaservidasobre el total servidas en cada continente
only_servings['average_beer'] = only_servings.apply(lambda row: (row.beer_servings * 100) /(row.beer_servings + row.spirit_servings + row.wine_servings), axis = 1) 
only_servings

           beer_servings  spirit_servings  wine_servings  average_beer
continent
AF                  3258              866            862     65.342960
AS                  1630             2677            399     34.636634
EU                  8720             5965           6400     41.356415
OC                  1435              935            570     48.809524
SA                  2101             1377            749     49.704282

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [26]:
drinks_continent.T.describe()

continent           AF           AS           EU           OC           SA
count         4.000000     4.000000     4.000000     4.000000     4.000000
mean       1286.350000  1200.375000  5368.200000   748.525000  1075.675000
std        1355.751584  1187.146395  3533.634997   583.128947   865.785706
min         159.400000    95.500000   387.800000    54.100000    75.700000
25%         686.350000   323.125000  4570.700000   441.025000   580.675000
50%         864.000000  1014.500000  6182.500000   752.500000  1063.000000
75%        1464.000000  1891.750000  6980.000000  1060.000000  1558.000000
max        3258.000000  2677.000000  8720.000000  1435.000000  2101.000000

continent
AF         count     53.000000
           mean      16.264151
           std       38.846419
           min        0.000000
           25%        1.000000
           50%        2.000000
           75%       13.000000
           max      233.000000
AS         count     44.000000
           mean       9.068182
           std       21.667034
           min        0.000000
           25%        0.000000
           50%        1.000000
           75%        8.000000
           max      123.000000
EU         count     45.000000
           mean     142.222222
           std       97.421738
           min        0.000000
           25%       59.000000
           50%      128.000000
           75%      195.000000
           max      370.000000
OC         count     16.000000
           mean      35.625000
           std       64.555790
           min        0.000000
           25%        1.000000
           50%        8.500000
           75%       23.250000
           max      212.000000
SA         count     12.000000
           mean      62.416667
           std       88.620189
           min        1.000000
           25%        3.000000
           50%       12.000000
           75%       98.500000
           max      221.000000
dtype: float64

### Step 6. Print the mean alcohol consumption per continent for every column

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302